//正则表达式常量

/***
 * + 匹配一次或多次, 等价于 {1,}
 * * 匹配零次或多次, 等价于 {0,}
 * \d 能匹配全角数字, [0-9]不能
 * () 表示组
 * [] 表示单个匹配
 * 
 * 
 */

export default {
    phone: '/^1[3-9]\d{9}$/', // 手机号码
    digit: '/^[0-9]+|(.[0-9]{1,2})?$/', //数字或有1到2位小数的数字
    email: '/^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/', //邮箱地址
    chineseChar: '/^[\u4e00-\u9fa5]+$/', //中文汉字
    upperCase: '/^[A-Z]+$/', //大写字母
    lowerCase: '/^[a-z]+$/', //小写字母
    alphabet: '/^[A-Za-z]+$/', //大小写字母
    alnum: '/^[A-Za-z0-9]+$/', //字母和数字
    comChar: '/^\w+$/' //由数字、26个英文字母或者下划线组成的字符串










}